2020vu-prog/esp32-rr1-timer/components/rr1_gps/nmea_rr1_uart.c
#include "driver/uart.h"
#include "esp_idf_version.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "nmea.h"
#include "nmea_rr1.h"

#include "rr1_pin_defs.h"

#include "sdkconfig.h"
#include <stdio.h>

#include "esp_log.h"

#define UART_NUM CONFIG_EXAMPLE_UART_NUM
#define UART_RX_PIN RR1_PIN_GPS_TX // gps tx wired to rx of esp32
#define UART_RX_BUF_SIZE (1024)

static char s_buf[UART_RX_BUF_SIZE + 1];
static size_t s_total_bytes;
static char *s_last_buf_end;

static const char *TAG = "nmea_uart";
void nmea_rr1_init_interface(void) {
  uart_config_t uart_config = {
      .baud_rate = 9600,
      .data_bits = UART_DATA_8_BITS,
      .parity = UART_PARITY_DISABLE,
      .stop_bits = UART_STOP_BITS_1,
      .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
      .source_clk = UART_SCLK_DEFAULT,
#endif
  };
  ESP_ERROR_CHECK(uart_param_config(UART_NUM, &uart_config));
  ESP_ERROR_CHECK(uart_set_pin(UART_NUM, UART_PIN_NO_CHANGE, UART_RX_PIN,
                               UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
  ESP_ERROR_CHECK(
      uart_driver_install(UART_NUM, UART_RX_BUF_SIZE * 2, 0, 0, NULL, 0));
}

void nmea_rr1_read_line(char **out_line_buf, size_t *out_line_len,
                        int timeout_ms) {
  *out_line_buf = NULL;
  *out_line_len = 0;

  if (s_last_buf_end != NULL) {
    /* Data left at the end of the buffer after the last call;
     * copy it to the beginning.
     */
    size_t len_remaining = s_total_bytes - (s_last_buf_end - s_buf);
    memmove(s_buf, s_last_buf_end, len_remaining);
    s_last_buf_end = NULL;
    s_total_bytes = len_remaining;
  }

  /* Read data from the UART */
  int read_bytes = uart_read_bytes(UART_NUM, (uint8_t *)s_buf + s_total_bytes,
                                   UART_RX_BUF_SIZE - s_total_bytes,
                                   pdMS_TO_TICKS(timeout_ms));
  ESP_LOGD(TAG, "uart_read_bytes: read %d bytes [%d]", read_bytes,
           s_total_bytes);
  if (read_bytes <= 0) {
    return;
  }
  s_total_bytes += read_bytes;

  /* find start (a dollar sign) */
  char *start = memchr(s_buf, '$', s_total_bytes);
  if (start == NULL) {
    s_total_bytes = 0;
    return;
  }

  /* find end of line */
  char *end = memchr(start, '\r', s_total_bytes - (start - s_buf));
  if (end == NULL || *(++end) != '\n') {
    return;
  }
  end++;

  end[-2] = NMEA_END_CHAR_1;
  end[-1] = NMEA_END_CHAR_2;

  *out_line_buf = start;
  *out_line_len = end - start;
  if (end < s_buf + s_total_bytes) {
    /* some data left at the end of the buffer, record its position until the
     * next call */
    s_last_buf_end = end;
  } else {
    s_total_bytes = 0;
  }
}